; domain
(define (domain recharging-robots)
(:requirements :typing :adl :action-costs)
(:types
    location - object
    robot - object
    battery-level - object
    config - object
)

(:predicates
    ;; The remaining battery of the robot
    (battery ?r - robot ?f - battery-level)
    ;; Robot is located at the given location
    (at ?r - robot ?l - location)
    ;; Two locations are connected in the graph of locations
    (CONNECTED ?l1 - location ?l2 - location)
    ;; Robot stopped and is guarding all locations connected to the
    ;; location where robot is located
    (stopped ?r - robot)
    ;; Location ?l is guarded by at least one robot
    (guarded ?l - location)
    ;; ?f1 is predecessor of ?f2 in the battery level, i.e., ?f2 = ?f1 + 1
    (BATTERY-PREDECESSOR ?f1 - battery-level ?f2 - battery-level)
    ;; Definition of a guarding configuration, i.e., one atom per location
    ;; in each configuration
    (GUARD-CONFIG ?c - config ?l - location)
    ;; Configuration is fullfilled, i.e., all of its locations were guarded
    ;; at some point.
    (config-fullfilled ?c - config)
)

(:functions
    (move-cost) - number
    (recharge-cost) - number
    (total-cost) - number
)

;; Move the robot ?r from the location ?from to the location ?to while
;; consuming the battery -- it is decreased by one from ?fpre to ?fpost
(:action move
    :parameters (?r - robot ?from - location ?to - location
                 ?fpre - battery-level ?fpost - battery-level)
    :precondition
        (and
            (not (stopped ?r))
            (at ?r ?from)
            (battery ?r ?fpre)
            (BATTERY-PREDECESSOR ?fpost ?fpre)
            (or (CONNECTED ?from ?to) (CONNECTED ?to ?from))
        )
    :effect
        (and
            (not (at ?r ?from))
            (at ?r ?to)
            (not (battery ?r ?fpre))
            (battery ?r ?fpost)
            (increase (total-cost) (move-cost))
        )
)

;; Recharge robot ?rto at location ?loc by transfering one unit of battery
;; charge from the robot ?rfrom
(:action recharge
    :parameters (?rfrom - robot ?rto - robot ?loc - location
                 ?fpre-from - battery-level ?fpost-from - battery-level
                 ?fpre-to - battery-level ?fpost-to - battery-level)
    :precondition
        (and
            (not (= ?rfrom ?rto))
            (at ?rfrom ?loc)
            (at ?rto ?loc)
            (battery ?rfrom ?fpre-from)
            (battery ?rto ?fpre-to)
            (BATTERY-PREDECESSOR ?fpost-from ?fpre-from)
            (BATTERY-PREDECESSOR ?fpre-to ?fpost-to)
        )
    :effect
        (and
            (not (battery ?rfrom ?fpre-from))
            (battery ?rfrom ?fpost-from)
            (not (battery ?rto ?fpre-to))
            (battery ?rto ?fpost-to)
            (increase (total-cost) (recharge-cost))
        )
)

;; Stop the robot at its current location and guard the neighborhood.
;; Once the robot stopped it can move again only when the configuration is
;; fullfilled, i.e., stopping too early can result in a dead-end.
;; Note that the conditional effect can be compiled away without blow-up,
;; because it is conditioned on a static predicates.
(:action stop-and-guard
    :parameters (?r - robot ?l - location)
    :precondition
        (and
            (not (stopped ?r))
            (at ?r ?l)
        )
    :effect
        (and
            (stopped ?r)
            (guarded ?l)
            (forall (?l2 - location)
                (when (or (CONNECTED ?l ?l2) (CONNECTED ?l2 ?l))
                      (guarded ?l2)
                )
            )
        )
)

;; Verify that the given configuration is fullfilled, i.e., robots guard
;; all locations from the configuration.
;; Note that this action unblocks all robots whether they participate in
;; guarding of the configuration or not. This simplifies the model because
;; otherwise, we would need to keep track of what location is guarded by
;; which robot (it can be guarded by multiple ones).
;; Also note the precondition does not have to inccur exponential blow-up
;; because the imply condition is conditioned on a static predicate.
(:action verify-guard-config
    :parameters (?c - config)
    :precondition
        (and
            (forall (?l - location)
                (imply (GUARD-CONFIG ?c ?l) (guarded ?l))
            )
        )
    :effect
        (and
            (forall (?r - robot) (not (stopped ?r)))
            (forall (?l - location) (not (guarded ?l)))
            (config-fullfilled ?c)
        )
)

)

; problem
;; Genearated with: generator.py single-source-move-to-locations --random-seed 20 3 5 4 1.4 Problems/PM01.pddl Problems/PM01.plan
;; Random seed: 20
(define (problem recharge-single-source-move-to-locations-9826)
(:domain recharging-robots)
(:objects
  location-0000 location-0001 location-0002 location-0003 location-0004 location-0005 location-0006 location-0007 location-0008 location-0009 location-0010 location-0011 location-0012 location-0013 location-0014 location-0015 location-0016 location-0017 location-0018 location-0019 location-0020 location-0021 location-0022 location-0023 - location
  robot-00 robot-01 robot-02 - robot
  battery-0000 battery-0001 battery-0002 battery-0003 battery-0004 battery-0005 battery-0006 battery-0007 battery-0008 battery-0009 battery-0010 battery-0011 battery-0012 battery-0013 - battery-level
)
(:init
  (= (move-cost) 1)
  (= (recharge-cost) 1)
  (= (total-cost) 0)
  (CONNECTED location-0015 location-0021)
  (CONNECTED location-0020 location-0023)
  (CONNECTED location-0012 location-0013)
  (CONNECTED location-0021 location-0022)
  (CONNECTED location-0003 location-0016)
  (CONNECTED location-0022 location-0023)
  (CONNECTED location-0003 location-0013)
  (CONNECTED location-0003 location-0019)
  (CONNECTED location-0008 location-0009)
  (CONNECTED location-0004 location-0021)
  (CONNECTED location-0017 location-0018)
  (CONNECTED location-0002 location-0005)
  (CONNECTED location-0011 location-0023)
  (CONNECTED location-0013 location-0014)
  (CONNECTED location-0002 location-0017)
  (CONNECTED location-0001 location-0015)
  (CONNECTED location-0016 location-0019)
  (CONNECTED location-0007 location-0010)
  (CONNECTED location-0018 location-0019)
  (CONNECTED location-0015 location-0020)
  (CONNECTED location-0004 location-0005)
  (CONNECTED location-0007 location-0022)
  (CONNECTED location-0005 location-0006)
  (CONNECTED location-0012 location-0015)
  (CONNECTED location-0004 location-0014)
  (CONNECTED location-0014 location-0015)
  (CONNECTED location-0014 location-0021)
  (CONNECTED location-0008 location-0011)
  (CONNECTED location-0009 location-0010)
  (CONNECTED location-0010 location-0011)
  (CONNECTED location-0008 location-0023)
  (CONNECTED location-0000 location-0013)
  (CONNECTED location-0009 location-0022)
  (CONNECTED location-0001 location-0020)
  (CONNECTED location-0013 location-0019)
  (CONNECTED location-0001 location-0023)
  (CONNECTED location-0006 location-0007)
  (CONNECTED location-0007 location-0009)
  (CONNECTED location-0004 location-0007)
  (CONNECTED location-0020 location-0021)
  (CONNECTED location-0004 location-0013)
  (CONNECTED location-0004 location-0022)
  (CONNECTED location-0000 location-0003)
  (CONNECTED location-0000 location-0012)
  (CONNECTED location-0008 location-0022)
  (CONNECTED location-0002 location-0018)
  (CONNECTED location-0016 location-0017)

  (BATTERY-PREDECESSOR battery-0000 battery-0001)
  (BATTERY-PREDECESSOR battery-0001 battery-0002)
  (BATTERY-PREDECESSOR battery-0002 battery-0003)
  (BATTERY-PREDECESSOR battery-0003 battery-0004)
  (BATTERY-PREDECESSOR battery-0004 battery-0005)
  (BATTERY-PREDECESSOR battery-0005 battery-0006)
  (BATTERY-PREDECESSOR battery-0006 battery-0007)
  (BATTERY-PREDECESSOR battery-0007 battery-0008)
  (BATTERY-PREDECESSOR battery-0008 battery-0009)
  (BATTERY-PREDECESSOR battery-0009 battery-0010)
  (BATTERY-PREDECESSOR battery-0010 battery-0011)
  (BATTERY-PREDECESSOR battery-0011 battery-0012)
  (BATTERY-PREDECESSOR battery-0012 battery-0013)

  (at robot-00 location-0020)
  (battery robot-00 battery-0002)
  (at robot-01 location-0020)
  (battery robot-01 battery-0011)
  (at robot-02 location-0020)
  (battery robot-02 battery-0000)

)
(:goal
  (and
    (at robot-00 location-0019)
    (at robot-01 location-0009)
    (at robot-02 location-0008)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (recharge robot-01 robot-00 location-0020 battery-0011 battery-0010 battery-0002 battery-0003)
   deleted: (battery robot-01 battery-0011) (battery robot-00 battery-0002)
   added: (battery robot-01 battery-0010) (battery robot-00 battery-0003)
   goals met: 0 of 3
2. (recharge robot-01 robot-00 location-0020 battery-0010 battery-0009 battery-0003 battery-0004)
   deleted: (battery robot-01 battery-0010) (battery robot-00 battery-0003)
   added: (battery robot-01 battery-0009) (battery robot-00 battery-0004)
   goals met: 0 of 3
3. (recharge robot-01 robot-02 location-0020 battery-0009 battery-0008 battery-0000 battery-0001)
   deleted: (battery robot-01 battery-0009) (battery robot-02 battery-0000)
   added: (battery robot-01 battery-0008) (battery robot-02 battery-0001)
   goals met: 0 of 3
4. (recharge robot-01 robot-02 location-0020 battery-0008 battery-0007 battery-0001 battery-0002)
   deleted: (battery robot-01 battery-0008) (battery robot-02 battery-0001)
   added: (battery robot-01 battery-0007) (battery robot-02 battery-0002)
   goals met: 0 of 3
5. (move robot-00 location-0020 location-0015 battery-0004 battery-0003)
   deleted: (at robot-00 location-0020) (battery robot-00 battery-0004)
   added: (at robot-00 location-0015) (battery robot-00 battery-0003)
   goals met: 0 of 3
6. (move robot-00 location-0015 location-0012 battery-0003 battery-0002)
   deleted: (at robot-00 location-0015) (battery robot-00 battery-0003)
   added: (at robot-00 location-0012) (battery robot-00 battery-0002)
   goals met: 0 of 3
7. (move robot-00 location-0012 location-0013 battery-0002 battery-0001)
   deleted: (at robot-00 location-0012) (battery robot-00 battery-0002)
   added: (at robot-00 location-0013) (battery robot-00 battery-0001)
   goals met: 0 of 3
8. (move robot-00 location-0013 location-0019 battery-0001 battery-0000)
   deleted: (at robot-00 location-0013) (battery robot-00 battery-0001)
   added: (at robot-00 location-0019) (battery robot-00 battery-0000)
   goals met: 1 of 3
9. (move robot-01 location-0020 location-0023 battery-0007 battery-0006)
   deleted: (at robot-01 location-0020) (battery robot-01 battery-0007)
   added: (at robot-01 location-0023) (battery robot-01 battery-0006)
   goals met: 1 of 3
10. (move robot-01 location-0023 location-0022 battery-0006 battery-0005)
   deleted: (at robot-01 location-0023) (battery robot-01 battery-0006)
   added: (at robot-01 location-0022) (battery robot-01 battery-0005)
   goals met: 1 of 3
11. (move robot-01 location-0022 location-0009 battery-0005 battery-0004)
   deleted: (at robot-01 location-0022) (battery robot-01 battery-0005)
   added: (at robot-01 location-0009) (battery robot-01 battery-0004)
   goals met: 2 of 3
12. (move robot-02 location-0020 location-0023 battery-0002 battery-0001)
   deleted: (at robot-02 location-0020) (battery robot-02 battery-0002)
   added: (at robot-02 location-0023) (battery robot-02 battery-0001)
   goals met: 2 of 3
13. (move robot-02 location-0023 location-0008 battery-0001 battery-0000)
   deleted: (at robot-02 location-0023) (battery robot-02 battery-0001)
   added: (at robot-02 location-0008) (battery robot-02 battery-0000)
   goals met: 3 of 3
